function [IJM]=FIJM(NY,NX)
% 为每个三角形元素分配一个唯一的元素编号。为每个元素指定三个顶点的节点号。
% IJM存储的是每个三角形元素的三个节点号，编号从左下角开始;且都是jm边位于边界

for i = 1:NY-1%i为三角形单元行数，从下向上
    for j = 1:2:2*(NX-1)-1
        if (j<2*(NX-1)-1)
            IJM((i-1)*(NX-1)*2+j,1) = NX+2+NX*(i-1)+(j-1)/2;
            IJM((i-1)*(NX-1)*2+j,2) = NX+1+NX*(i-1)+(j-1)/2;
            IJM((i-1)*(NX-1)*2+j,3) = 1+NX*(i-1)+(j-1)/2;
            IJM((i-1)*(NX-1)*2+j+1,1) = NX+2+NX*(i-1)+(j-1)/2;
            IJM((i-1)*(NX-1)*2+j+1,2) = 1+NX*(i-1)+(j-1)/2;
            IJM((i-1)*(NX-1)*2+j+1,3) = 2+NX*(i-1)+(j-1)/2;
        else%右侧边界三角形方向变化
            IJM((i-1)*(NX-1)*2+j,1) = NX*2-1+NX*(i-1);
            IJM((i-1)*(NX-1)*2+j,2) = NX-1+NX*(i-1);
            IJM((i-1)*(NX-1)*2+j,3) = NX+NX*(i-1);
            IJM((i-1)*(NX-1)*2+j+1,1) = NX*2-1+NX*(i-1);
            IJM((i-1)*(NX-1)*2+j+1,2) = NX+NX*(i-1);
            IJM((i-1)*(NX-1)*2+j+1,3) = 2*NX+NX*(i-1);
        end
    end
end

end

